{
  "item.spawn_egg.entity.pik:scallion.name": "Spawn Scallion",
  "pik.fmode.hint": "§eFollow Mode:%1Pikmins on follow mode will attack anything that you attack or tries to attack you%1-They will also bring nearby items to you without need to throw them.%1-Sneak and interact with them or use your whistle to call them back.§r",
  "pik.piklopedia.not_creative": "This can't be used on creative, sorry :(",
  "pik.initial.menssege": "Hello, I'm the addon creator, Axelpvz2030%1This mod could be a bit complex, so I made a guide, which should be in your inventory.%1Open it to read about everything you need about the addon, take a look at the \"Quick Guide\" section first if you find the rest a bit overwhelming, or try hitting any entity with the book to open its related section.%1 If you lose the guide you can craft it with a sapling and a regular book.",
  "pik.piklopedia.hide": "§r",
  "pik.piklopedia.close": "Close",
  "pik.piklopedia.return": "Return",
  "pik.piklopedia.name": "§5§lPiklopedia",
  "pik.piklopedia.menu": "§2---------------------------------§r%1This book will guide you on everything pikmin related.%1%1Find information about any topic of interest here, or hit something from the mod with this books anything you find to open its related article.",
  "pik.piklopedia.quick_guide_section": "Quick Guide",
  "pik.piklopedia.get_pikmin_section": "Getting Pikmin",
  "pik.piklopedia.use_pikmin_section": "Pikmin Use/Care",
  "pik.piklopedia.farm_pikmin_section": "Farming Pikmin",
  "pik.piklopedia.pikmin_types_section": "Pikmin Types",
  "pik.piklopedia.onion_section": "Onions/Colonies",
  "pik.piklopedia.quick_guide": "§2---------------------------------§r%1§d§oQuick Guide§r%1%1This is a quick guide on the basics of the addon. The most important info is briefly explained here, however, I recommend you to consult the rest of this book for more detailed explanations:%1%1First of all, the Pikmin whistle is crafted with one iron ingot and one iron nugget in front of it.%1%1§5What are Pikmin?§r%1Pikmin are basically helpers. You get them as a throwable item, throw at an item and they will bring it to you, throw at a mob and they will attack it, even stick to the enemy if you aim well.%1%1You can call them with a whistle, craftable by an iron ingot an iron nugget, or wait until they return on their own. If you throw them while sneaking they will follow you instead, attacking nearby threats and bringing nearby items to you without the need of instructions, until you call them back.%1%1There are many kinds of Pikmin, each one with its own abilities and special interactions, you can check this on more detail reading the §d§oPikmin Types§r section, or punching a Pikmin with this book. %1%1§5What are onions?§r%1%1Onions are the main source of Pikmin, mainly found around the world trapped or laying on the ground, you have to tame one first using sugar, then sit the onion somewhere. While sitting onions can absorb mobs or pellets to produce Pikmin seeds of a specific type, said seeds grow over time or by using bone meal, and once grown can be harvested for more Pikmin by interacting with them. Onions can store Pikmin or be used to create colonies, both things are explained in more detail in their dedicated section.",
  "pik.piklopedia.pikmin_types": "§2---------------------------------§r%1§d§oPikmin Types§r%1%1Each type of pikmin has special uses and abilities, learning to use the right pikmin for the right task is very important.",
  "pik.piklopedia.red_pikmin_section": "§4Red Pikmin",
  "pik.piklopedia.red_pikmin": "§2---------------------------------§r%1§4§oRed Pikmin§r%1%1Red Pikmin are great fighters, dealing §53 damage per attack§r, the second-highest among Pikmin.%1%1Red Pikmin are also §5fire immune§r and §5can walk on lava§r, perfect for combat in the nether or against enemies that use fire in some way. If you throw them directly at the fire, they'll §5start extinguishing all nearby flames§r.",
  "pik.piklopedia.yellow_pikmin_section": "§6Yellow Pikmin",
  "pik.piklopedia.yellow_pikmin": "§2---------------------------------§r%1§6§oYellow Pikmin§r%1%1Yellow Pikmin are §5lighter§r than other Pikmin, being able to reach §5further places§r and easier to aim.%1Yellow Pikmin can also conduct electricity, which gives them different abilities. First, they are immune to electrical damage, including §5lightning bolts§r, Yellow Pikmin can emit light, working as a §5portable light source§r. %1%1And lastly, Yellow Pikmin can cause tiny sparks when they hit something, both when being thrown or fighting an enemy. These sparks cause §5area damage§r to all §5non-Pikmin entities§r and players that §5don't have any Yellow Pikmin§r in their inventories, being electric-based, this attack can also trigger §5lightning bolt-related reactions§r, such as transforming villagers into witches, charging creepers, etc.%1%1After each spark, Yellow Pikmin need 2 seconds to recharge, but the sparks can §5pass to other Yellow Pikmin§r, becoming §5bigger and longer§r with the more are in one area.",
  "pik.piklopedia.blue_pikmin_section": "§9Blue Pikmin",
  "pik.piklopedia.blue_pikmin": "§2---------------------------------§r%1§9§oBlue Pikmin§r%1%1Blue Pikmin, unlike other Pikmin, can §5breathe underwater§r and are able to swim, really fast in fact, being able to match the player's normal swimming speed.%1%1Blue Pikmin are average Pikmin outside water, but they still can come in handy, if another Pikmin starts drowning just throw a Blue one, and they will §5rescue the drowning Pikmin§r.",
  "pik.piklopedia.onion": "§2---------------------------------§r%1§d§oOnions§r%1%1Onions are the §5home and source§r of Pikmin, each one corresponds to a specific Pikmin type, easy to identify for thier colors. If you want Pikmin, you must §5find and rescue§r one of these. Once you do it, there is still a bit more you need to know about them.",
  "pik.piklopedia.ko_onion_section": "Get an Onion",
  "pik.piklopedia.ko_onion": "§2---------------------------------§r%1§d§oGet an Onion§r%1%1Around the world you could find onions laying on the ground or §5trapped in some way§r, these onions had been attacked by monsters and have no energy left to move. If you can rescue one, give the onion §5sugar§r so it can recover energy to fly, do so and it will trust you, allowing you to §5farm and use§r a type of Pikmin depending on the onion (Check \"Rescued Onions\" section for more info).",
  "pik.piklopedia.tamed_onion_section": "Rescued Onions",
  "pik.piklopedia.tamed_onion": "§2---------------------------------§r%1§d§oRescued Onions§r%1%1Once you gain the trust of an onion you can consider it as yours, so it's important to know all that can do with one. When the onion wakes up for the first time it will start flying and following you, but you can §5sit it anywhere§r to make it stop, or use a whistle to §5call it to your position§r if you want it on a specific spot.%1%1Once you order it to sit the onion will extend its legs and stay on the ground, in this state it can absorb pellets and some mobs to §5produce seeds§r, seeds that end up growing into §5Pikmin§r (Check the Pikmin Farming section for more info). Pellets produce the exact number of seeds their number indicates if they §5match the color§r of the onion, mobs on other hand produce §5half a seed for each 4 hp§r they have at the moment of being absorbed, with a maximum of §510 seed per mob§r. Using Onions you own for colonies is the best way of making use of one, all Pikmin that live in your onions will go inside it every time the onion starts flying, making it §5easier to move§r the whole group. In this state, they §5can't be hurt by the players§r, and you can §5control if they stay outside§r during the day or not by using your whistle on the onion.%1%1Finally, Onions are the perfect way to store your Pikmin, drop them nearby the onion and they'll join the colony. Then, if there are Pikmin inside the onion, you can call them to your inventory by sneaking and interacting with your inventory, and you can force Pikmin from onions you own to go inside at any time. This is the perfect way of keeping them safe of any danger and any thief that could steal them, unlike chest and similar containers.",
  "pik.piklopedia.wild_onion_section": "Wild Onions",
  "pik.piklopedia.wild_onion": "§2---------------------------------§r%1§d§oWild Onions§r%1%1Not all onions are laying on the ground, on some dangerous place. You can also found them in the wild just living their lives. Wild onions can be found randomly in the world, sometimes §5nearby pellet posies§r that they use to grow more Pikmin.%1%1Unlike onions you own, wild onions won't produce any seed when absorbing sometime, or at least §5not seeds you can use§r, the seeds they produce will grow and stay inside the onion unless there are §5less than 10 Pikmin§r on the colony, the maximum number of Pikmin a wild colony can reach by its own means. Also, when nighttime comes, the onion will §5fly to the sky§r and leave with all their Pikmin to avoid the danger, not returning §5until the next day§r.%1%1Pikmin from wild colonies behave almost like Pikmin from player owned onions, but with the exceptions that they won't obey any player, and are §5neutral to players§r, defending themselves if you mess with them. Wild onions are of almost no use for players, can be an opportunity to get Pikmin if the player doesnt have one. if, somehow, a Pikmin §can't reach its onion§r before it flies in the sky will becomes lost, but, please, just limit yourself to just rescue Pikmin that get stuck on some place by themselves, I know what you are thinking.  ",
  "pik.piklopedia.colony_section": "Pikmin Colonies",
  "pik.piklopedia.colony": "§2---------------------------------§r%1§d§oPikmin Colonies§r%1%1Pikmin can live inside Onions and form colonies, there are Wild colonies that you can find around the world, but you can also make §5your own colonies§r by dropping Pikmin as an item nearby your onions. In both cases, Pikmin that belong to a colony will go §5wander around the onion during the day§r and go inside the onion during the night, which also will leave if is a wild onion.%1%1Making a Pikmin colony can have its uses apart from just having the Pikmin doing their stuff without the risk of them leaving the place. Pikmin that are on colonies will automatically §5pluck any grown Pikmin seed§r of their kind, which will automatically join the colony, so you can take the Pikmin later. They will also §5collect pellets§r from nearby pellet posies and §5bring them to the onion§r, so it can absorb it and create new Pikmin. both things together opens the option for §5automatic Pikmin farm§r. Pikmin from colonies attack and are attacked by every mob that is §5directly hostile§r to the player with the exception of creepers. This can be good or bad depending on the number of Pikmin.%1%1And finally, only §520 Pikmin§r can be outside of the onion per colony. If there are more, they will §5stay inside the onion§r, to decrease the amount of entities in the world. (so you can leave the Pikmin doing their stuff and farm Pikmin without lagging your game, passed the 20 Pikmin all new ones will go to the onion and stay inside until you take them by yourself)",
  "pik.piklopedia.use": "§2---------------------------------§r%1§d§oPikmin Use and Care§r%1%1Once you have the Pikmin in your hand (quite literally), you can do a lot of stuff with them, but also you need to know how to take care of them so they don't die. The basics are, throw them at something to make them do something, use your whistle to §5call them backr to you, §5sneak and interact with them to take them§r.%1%1Also, Pikmin normally §5come back to you on their own§r after doing their task, can't find something to do, or if they have low health. They also §5avoid creepers§r and enemies when the Pikmin are at low health. they §5regenerate health§5 over time and almost all of them have §58 hp and deal 2 damage§r when attacking, but no damage when thrown at something. If you want more details on some topics check the subsections below this, also take a look at the \"Pikmin Types\" section to know more about the abilities of your small army.  ",
  "pik.piklopedia.throw_section": "Throw Commands",
  "pik.piklopedia.throw": "§2---------------------------------§r%1§d§oThrow Commands§r%1%1More of the things Pikmin do depend on how and where you throw them, here is an explanation of every command you can give to your Pikmin by throwing them.%1%1-Throwing them at an item to make them bring it to you%1%1-Throw them at a mob to make them attack it, if you aim well they can even grab from it while attacking until the enemy shakes the Pikmin off.%1%1-.Throw  Blue Pikmin to any drowning Pikmin to rescue it%1%1-Throw a Red Pikmin to the fire to make it extinguish nearby flames.%1%1-Throw them when sneaking to activate §d§oFollow Mode§r(Check the follow mode section for more info)",
  "pik.piklopedia.follow_section": "Follow Mode",
  "pik.piklopedia.follow": "§2---------------------------------§r%1§d§oFollow Mode§r%1%1When you throw a Pikmin while sneaking, they will start following instead of just §5doing their task and going back to your inventory§r. This changes some things in their behavior.%1%1Pikmin in follow mode will follow and behave almost like a tamed dog, they'll follow you and §5protect you§r, not only attacking whatever you hurt or hurts you, but dealing with §5monsters that try to reach§r you before they can do something. But don't confuse things, if the mob is just passing by or doesn't know you are there, the Pikmin will §5ignore them§r, so you don't have to worry about having them nearby zombified pigling or similar mobs. Also, Pikmin prioritize protect you over finishing a foe, so they'll stay around you and leave an enemy if you are §5not close enough§r.%1%1Pikmin in follow mode will also bring nearby items to you, similar to the allays, but not limited to a single item, some abilities of some Pikmin are only useable on follow mode, so take a close look at their respective sections in this book so you don't miss anything.",
  "pik.piklopedia.panic_section": "Panicked Pikmin",
  "pik.piklopedia.panic": "§2---------------------------------§r%1§d§oPanicked Pikmin§r%1%1Pikmin can be brave, but that doesn't mean they can't feel fear, Pikmin will start running from the enemy if §5their health is too low§r and come back to you unless they are on follow mode, in that case, they'll come back to the fight when §5their health regenerates§r.%1%1Pikmin also fear other things, most of them are unable to swim, so they'll try to run back to you as soon as §5they touch water§r, which in most cases can end up killing them because of how easy they can drown. However, the most dangerous scenario is when a Pikmin gets §5poisoned or starts burning§r, in both cases they lose their mind and start §5running without control§r until the fire/poison passes or you call them back with the whistle, making them vulnerable,§5sneak and use your whistle§r to call only the panicked Pikmin before they put themselves on greater danger. ",
  "pik.piklopedia.lost_section": "Lost Pikmin",
  "pik.piklopedia.lost": "§2---------------------------------§r%1§d§oLost Pikmin§r%1%1Pikmin are considered \"lost\" when they don't have a safe place to go. This happens when a Pikmin from a Pikmin Colony §5can't reach its onion§r in time or if a player tries to §5drop them like an item§r, dropping the Pikmin instead. Lost Pikmin will start finding a safe spot, that can be a nearby onion or a player. If there are onions nearby they'll run to one and §5join the colony§r, and if not, a player can just call them with a whistle and they'll §5enter the player's inventory§r (Doesn't works on creative mode).",
  "pik.piklopedia.farm": "§2---------------------------------§r%1§d§oFarming Pikmin§r%1%1The main thing you need to farm Pikmin is an onion, but there are some other things you need to know about to farm Pikmin. You can check about them here along side some tips.",
  "pik.piklopedia.seed_section": "Pikmin Seeds",
  "pik.piklopedia.seed": "§2---------------------------------§r%1§d§oPikmin Seeds§r%1%1When an onion absorbs a §5mob or a pellet§r, it will produce seeds, up to half a seed per each 4 hp the a mob has, or the same amount the pellet indicates with their numbers.%1%1Seeds will §5grow into a Pikmin§r eventually, and you can know if a seed is fully grown by its size. they are very small at first, but become the size of a regular Pikmin when they have grown, and at this point, you can interact with them to §5take the Pikmin§r or let §5other Pikmin§r of its type that lives in a colony pluck it out of the ground instead.%1%1Pikmin seeds can also be §5intantly grown§r with the use of a single bone meal.",
  "pik.piklopedia.pellet_section": "Pellets",
  "pik.piklopedia.pellet": "§2---------------------------------§r%1§d§o%1Pellets and Pellet Posies§r%1%1Pellets are an altertnative way to feed an onion and produce more Pikmin, and they are produced by §5pellet posies§r.%1%1Pellet posies can be found around the world, normally as a §5plant with four big leaves pointing up§r, similar to a fern. In most cases, they need to be §5replanted§r by the player (Just break the block and place it again) before they can produce any pellets, except for a few ones that can be found nearby wild onions, that have been replanted by the Pikmin already.%1%1Once replanted, a §5flower will grow§r from plant after a while, carrying a 1 sized pellet, this can be already harvested , but can grow into a §5bigger pellet§r if left alone long enough.%1%1To harvest the pellet, §5throw a pikmin§r to the pellet posy to make the pikmin harvest it. §5Only pikmin can harvest§r pellets, and they'll only harvest pellets of §5their same color§r. Pikmin from colonies (Check the Onion/Colonies section for more info) will also §5harvest pellets and bring them to their onion§r.%1%1To use a pellet you just have to drop it near to an §5onion of the same color§r, so it can absorb it. The amount of seeds produced per pellet its indicated by §5the number on the pellet§r.",
  "pik.piklopedia.farm_tips_section": "Farming Tips",
  "pik.piklopedia.farm_tips": "§2---------------------------------§r%1§d§o%1Farming Tips§r%1%1There are two ways to approach Pikmin farming: make a colony, or do it by yourself. Each option has advantages and disadvantages.%1%1First, making use of a colony for Pikmin farming will make the process easier, as it will be §5automatic§r. All you have to do is provide the colony with a constant supply of food, that can be §5pellet posies§r or any sort of mob farm. Using pellet posies is the §5best option§r for this, as all you have to do is place them nearby the onion an the Pikmin will harvest and bring the pellets to the onion by themselves. Using a mob farm is also an option, but it §5can be risky§r, since hostile mobs could §5attack and even kill§r some of your Pikmin. As for non hostile mobs, they normally don't have too much hp, making them an §5innefficient alternative§r.%1On other hand, make use of Pellet posies can be inneficient too, as the Pikmin will harvest them wthout wait for them to fully grow, and Pikmin §5stay in the onion during night§r, so no Pikmin will be left to harvest them until next day. Even so, the Pikmin seeds and pellet posies will continue to grow during night.%1%1Now, farming Pikmin by yourself can be tedius, but its more efficient and safer for your Pikmin. You can order your Pikmin to stay inside the onion and set up any mob farm without the risk of the mobs killing your pikmin, or just have pellet posies and let them grow to their max size, then harvest them and bring the pellets to the onion for the maximun return. Once the seeds hit the ground, you can use §5bone meal§r to grow them instantly and get a §5bunch of Pikmin in a matter of seconds§r.%1%1Both metods are viable, but it matters which one you use to get more Pikmin.",
  "entity.pik:red_onion.name": "Red Onion",
  "entity.pik:scallion.name": "Scallion",
  "item.spawn_egg.entity.pik:wild_red_onion.name": "Wild Red Pikmin Colony \"Use on ground\"",
  "item.spawn_egg.entity.pik:red_onion.name": "Knocked Out Red Onion",
  "entity.pik:red_pikmin.name": "Red Pikmin",
  "entity.pik:yellow_onion.name": "Yellow Onion",
  "item.spawn_egg.entity.pik:wild_yellow_onion.name": "Wild Yellow Pikmin Colony \"Use on ground\"",
  "item.spawn_egg.entity.pik:yellow_onion.name": "Knocked Out Yellow Onion",
  "entity.pik:yellow_pikmin.name": "Yellow Pikmin",
  "entity.pik:blue_onion.name": "Blue Onion",
  "item.spawn_egg.entity.pik:wild_blue_onion.name": "Wild Blue Pikmin Colony \"Use on ground\"",
  "item.spawn_egg.entity.pik:blue_onion.name": "Knocked Out Blue Onion",
  "entity.pik:blue_pikmin.name": "Blue Pikmin",
  "entity.pik:pikmin_pickup.name": "§r",
  "item.pik:red_pikmin_item": "Red Pikmin",
  "tile.pik:red_pellet_posy_block.name": "Red Pellet Posy",
  "tile.pik:red_pellet1.name": "Red Pellet 1",
  "tile.pik:red_pellet5.name": "Red Pellet 5",
  "item.pik:yellow_pikmin_item": "Yellow Pikmin",
  "tile.pik:yellow_pellet_posy_block.name": "Yellow Pellet Posy",
  "tile.pik:yellow_pellet1.name": "Yellow Pellet 1",
  "tile.pik:yellow_pellet5.name": "Yellow Pellet 5",
  "item.pik:blue_pikmin_item": "Blue Pikmin",
  "tile.pik:blue_pellet_posy_block.name": "Blue Pellet Posy",
  "tile.pik:blue_pellet1.name": "Blue Pellet 1",
  "tile.pik:blue_pellet5.name": "Blue Pellet 5",
  "item.pik:white_pikmin_item": "Pikmin Blanco",
  "item.pik:pikmin_whistle": "Pikmin Whistle"
}