{
  "action.interact.ride.yoshimod:yoshi": "Ride",
  "action.hint.exit.yoshimod:yoshi": "Tap sneak to dismount",
  "action.hint.exit.console.yoshimod:yoshi": "Press :_input_key.sneak: to dismount",
  "attribute.name.yoshimod:yoshi.jumpStrength": "Yoshi Jump Strength",
  "item.spawn_egg.entity.yoshimod:yoshi.name": "Spawn Yoshi",
  "item.spawn_egg.entity.yoshimod:zomshi.name": "Spawn Zomshi",
  "tile.yoshimod:green_yoshi_egg.name": "Green Yoshi Egg",
  "tile.yoshimod:red_yoshi_egg.name": "Red Yoshi Egg",
  "tile.yoshimod:orange_yoshi_egg.name": "Orange Yoshi Egg",
  "tile.yoshimod:yellow_yoshi_egg.name": "Yellow Yoshi Egg",
  "tile.yoshimod:cyan_yoshi_egg.name": "Cyan Yoshi Egg",
  "tile.yoshimod:blue_yoshi_egg.name": "Blue Yoshi Egg",
  "tile.yoshimod:purple_yoshi_egg.name": "Purple Yoshi Egg",
  "tile.yoshimod:pink_yoshi_egg.name": "Pink Yoshi Egg",
  "tile.yoshimod:white_yoshi_egg.name": "White Yoshi Egg",
  "tile.yoshimod:black_yoshi_egg.name": "Black Yoshi Egg",
  "item.yoshimod:yoshi_fruit": "Yoshi Fruit",
  "item.yoshimod:yoshi_boots": "Yoshi Shoes",
  "item.yoshimod:torn_yoshi_boots": "Tattered Yoshi Shoes",
  "entity.yoshimod:yoshi.name": "Yoshi",
  "entity.yoshimod:zomshi.name": "Zomshi",
  "tips.game.1": "Use seagrass to attract and breed sea turtles.",
  "tips.game.2": "Protect baby turtles from hostile mobs!",
  "tips.game.3": "Baby turtles will drop scutes when they grow - these can be crafted into turtle shells.",
  "tips.game.4": "Use a bed to set your respawn point during the day.",
  "tips.game.5": "Brew some water breathing potions for underwater exploration!",
  "tips.game.6": "Dolphins can lead you to shipwrecks and underwater ruins, feed them cod and follow their trail!",
  "tips.game.7": "Use shears to carve a pumpkin.",
  "tips.game.8": "Use phantom membranes to repair your elytra.",
  "tips.game.9": "There are 3587 types of tropical fish!",
  "tips.game.10": "Sea pickles can be smelted into lime green dye.",
  "tips.game.11": "Use haybales to breed Llamas!",
  "tips.game.12": "Compasses always point to the world spawn - craft one to find your way!",
  "tips.game.13": "Trade with villagers to obtain food, tools, and even treasure maps!",
  "tips.game.14": "Did you know you can hold a map in your off-hand?",
  "tips.game.15": "Leads can be used on boats.",
  "tips.game.16": "Sneak or wear frost walker boots to walk safely on magma blocks.",
  "tips.game.17": "You can gather cob webs using shears.",
  "tips.game.18": "Need diamonds? Try mining on Y coordinate 12!",
  "tips.game.19": "Before you mine diamonds, redstone or gold, make sure you're using an iron or diamond pickaxe or the ore won't drop.",
  "tips.game.20": "Need coal for torches or fuel? Try smelting wood logs in a furnace to make charcoal!",
  "tips.game.21": "Gold is more abundant in Mesa biomes!",
  "tips.game.22": "Elytra can be used to glide, find them in End City ships!",
  "tips.game.23": "Test out some new features by turning on the Experimental Gameplay option!",
  "tips.game.24": "Tridents are dropped by the Drowned, and can be held or thrown.",
  "tips.game.25": "Check out mixer.com/minecraft to watch the latest Minecraft livestreams.",
  "tips.game.26": "You can smelt 20 items in a furnace by using a block of dried kelp as fuel.",
  "tips.game.27": "Monsters that are killed by skeletons arrows have a chance of dropping music discs.",
  "tips.game.28": "People like YOU make Marketplace content!",
  "tips.game.29": "Did you know that several community creators make a living off the content in the Marketplace?",
  "tips.game.30": "You can find skins to customize your experience in-game, or on select platforms use your own!",
  "tips.game.31": "Texture packs change the way that blocks, items, and even the menus look in game. Try them out!",
  "tips.game.32": "Check out the Marketplace to find new worlds and adventures.",
  "tips.game.33": "Apply to become a Marketplace Creator!",
  "tips.game.34": "Mash-up packs come with a world to explore, skins, textures, and even new music.",
  "tips.game.35": "Did you know there are over 500 community-created Marketplace packs with more added every week?",
  "tips.game.36": "Join the discussion at discord.gg/Minecraft",
  "tips.game.37": "Emerald ores are the rarest ores in Minecraft! They can only be found in extreme hill biomes!",
  "tips.game.38": "Taming a skeleton horse doesn't require a saddle.",
  "tips.game.39": "Ocelots show creepers who's boss!",
  "tips.game.40": "Diorite, you either love it or hate it.",
  "tips.game.41": "Phantoms are dangerous mobs that appear during the night. Make sure to sleep regularly!",
  "tips.game.42": "Zombies turn into drowned if they sink underwater.",
  "tips.game.43": "Minecraft Live takes place every year! Look out for the next one!",
  "tips.game.44": "Using fireworks boosts elytra speed in mid air. Just... make sure they don't explode, otherwise it'll hurt BADLY!",
  "tips.game.45": "Gold is most common in mesa biomes.",
  "tips.game.46": "Do people actually read these?",
  "tips.game.47": "Infinite wonders, Endless possibilities.",
  "tips.game.48": "DON'T LEAVE TREES FLOATING",
  "tips.game.49": "Sprint in water to swim!",
  "tips.game.50": "Riptide enchantment will propel you through the air in the rain.",
  "tips.game.51": "Minecraft Live is a worldwide interactive live-streaming event. Grab your items and join the party!",
  "tips.game.52": "Be nice to animals!",
  "tips.game.53": "The Beacon is a powerful item that can only be crafted with a nether star from the Wither!",
  "tips.game.54": "Don't kill dolphins, you monster!",
  "tips.game.55": "Did you know that nether stars can't be destroyed by explosions?",
  "tips.game.56": "When digging straight up, place a torch at your feet to break any sand or gravel that could potentially fall down on you.",
  "tips.game.57": "You can barter with Piglins",
  "tips.game.58": "Shear a Beehive or nest to get Honeycomb, use a Bottle to get honey",
  "tips.game.59": "Place a Campfire under a Beehive or nest to harvest honey peacefully. Your bees will thank you.",
  "tips.game.60": "Respawning in the Nether requires a charged Respawn Anchor",
  "tips.game.61": "You can charge a Respawn Anchor with Glowstone.",
  "tips.game.62": "Got an idea? Visit feedback.minecraft.net!",
  "tips.game.63": "Allays can be found in Pillager Outposts and Woodland Mansions.",
  "tips.game.64": "The Allay loves to collect items! If you give it a certain item it will try to collect more of it.",
  "tips.game.65": "Allays love music and therefore interact with Noteblocks!",
  "tips.game.66": "Ancient cities can be found under mountain ranges.",
  "tips.game.67": "When wandering in Deep Dark, silence is key.",
  "tips.game.68": "Use a water bottle on a dirt block to get mud!",
  "tips.game.69": "Frogs eat small and blocky mobs.",
  "tips.game.70": "Frogs pick a variant based on the temperature of the biome the tadpole grow up in.",
  "tips.game.71": "You can collect tadpoles in buckets.",
  "tips.game.72": "Just like skeleton horses, Yoshis can be controlled without a saddle.",
  "tips.game.73": "If you want your Yoshi to stop following you in dangerous situations, attach it to a lead and tie it to a pole like you would with any other mob.",
  "tips.game.74": "A Yoshi is a trustworthy friend, as explained by them following you around.",
  "tips.game.75": "A Zomshis can be easily confused for green Yoshis, unless their eyes give it away.",
  "tips.game.76": "Yoshis come in a variety of colors. The blurple one is the rarest.",
  "tips.game.77": "Yoshis can survive large falls, but make sure the cliff is not too high!",
  "tips.game.78": "Yoshis eat evil gray villagers, but not the magic ones.",
  "tips.game.79": "Zomshis can be cured with a weakness splash potion and a Yoshi Fruit. Sadly, they can't remember anything after their infection.",
  "tips.game.80": "Killing Yoshis is cruel. Period.",
  "tips.game.81": "Yoshis have human-like intelligence. They're smart enough to open doors!",
  "tips.game.82": "Yoshis can only be found in Forests and Jungles.",
  "tips.game.83": "Just like other undead mobs, Zomshis are vulnerable to sunlight.",
  "tips.game.84": "Zomshis are hostile mobs hat only appear at night and in dark areas. Stay aware of you and your Yoshi's surroundings.",
  "tips.game.85": "Zomshis not only attack you and other Yoshis, but they also attack villagers!",
  "tips.game.86": "Have bug reports for the Yoshi Mod? Let us know at https://discord.gg/t3FxaVg!",
  "tips.game.87": "You can craft a Yoshi Fruit by smearing the bottom of an apple with gold... For some reason.",
  "tips.game.88": "Some zombies remember how to ride Yoshis when they were still pure.",
  "tips.game.89": "Yoshi houses can be rarely found in plains biomes.",
  "tips.game.90": "Baby Zomshis are very fast and furious. Only one thing left to do... Run."
}